#+TITLE: Interactive simulations
#+SETUPFILE: setup.org
#+PROPERTY: header-args:sh :eval never-export :results output

* Test environment

  Get a local compute node.

  #+BEGIN_SRC sh :session midway2
    srun -n1 --partition=broadwl --pty bash
    cd /project2/mstephens/aksarkar/projects/singlecell-modes/browser/
    source activate scmodes
  #+END_SRC

  #+RESULTS:
  : 
  : srun: job 63584459 queued and waiting for resources
  : srun: job 63584459 has been allocated resources
  : cd /project2/mstephens/aksarkar/projects/singlecell-modes/browser/
  : cd /project2/mstephens/aksarkar/projects/singlecell-modes/browser/
  : source activate scmodes
  : source activate scmodes
  : echo 'org_babel_sh_eoe'

  (Re)start the browser

  #+BEGIN_SRC sh :session midway2
    pkill -u aksarkar bokeh
    bokeh serve capture gof --address $(hostname -i) --allow-websocket-origin=$(hostname -i):5006 &
  #+END_SRC

  #+RESULTS:
  : pkill -u aksarkar bokeh
  : Received signal 15, shutting down
  : (hostname -i) --allow-websocket-origin=$(hostname -i):5006
  : bokeh serve capture gof --address $(hostname -i) --allow -websocket-origin=$(hostname -i):5006 &
  : [7] 22484

* Production environment

  Start a remote session on ~shiny.stephenslab.uchicago.edu~.

  #+BEGIN_SRC sh :session shiny
    ssh shiny
  #+END_SRC

  #+RESULTS:
  #+begin_example

  Welcome to Ubuntu 18.04.1 LTS (GNU/Linux 4.15.0-65-generic x86_64)

   ,* Documentation:  https://help.ubuntu.com
   ,* Management:     https://landscape.canonical.com
   ,* Support:        https://ubuntu.com/advantage

    System information as of Mon Nov  4 13:15:41 CST 2019

    System load:                    0.2
  of 1.79TB

  Processes:                      199
    Users logged in:                1
    IP address for enp3s0:          128.135.144.117
    IP address for br-477fc3903e97: 172.21.0.1
    IP address for br-898024e7fc6a: 172.19.0.1
    IP address for docker0:         172.17.0.1
    IP address for br-c0049a5f822d: 172.20.0.1

   ,* Kata Containers are now fully integrated in Charmed Kubernetes 1.16!
     Yes, charms take the Krazy out of K8s Kata Kluster Konstruction.

       https://ubuntu.com/kubernetes/docs/release-notes

   ,* Canonical Livepatch is available for installation.
     - Reduce system reboots and improve kernel security. Activate at:
       https://ubuntu.com/livepatch

  233 packages can be updated.
  0 updates are security updates.


  ,*** System restart required ***
  Last login: Mon Nov  4 12:25:32 2019 from 128.135.112.68
  #+end_example

  Add the Debian Stretch box using the full URL.

  #+BEGIN_SRC sh :session shiny
    vagrant box add --provider=virtualbox "https://app.vagrantup.com/debian/boxes/stretch64"
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
    ==> box: Loading metadata for box 'https://app.vagrantup.com/debian/boxes/stretch64'
    echo 'org_babel_sh_eoe'
    ==> box: Adding box 'debian/stretch64' (v9.5.0) for provider: virtualbox
        box: Downloading: https://vagrantcloud.com/debian/boxes/stretch64/versions/9.5.0/providers/virtualbox.box
    ==> box: Successfully added box 'debian/stretch64' (v9.5.0) for 'virtualbox'!
  #+END_EXAMPLE

  Initialize the VM.

  #+BEGIN_SRC ruby :eval never :tangle /ssh:shiny:/home/aksarkar/scmodes/Vagrantfile
    Vagrant.configure(2) do |config|
      config.vm.box = "debian/stretch64"
      config.vm.network "forwarded_port", guest: 5006, host: 5009
      config.vm.provider "virtualbox" do |vb|
        vb.name = "singlecell-modes"
        vb.customize ["modifyvm", :id, "--cableconnected1", "on"]
      end
      config.vm.provision "shell", inline: <<-SHELL
        apt-get update
        apt-get install git
        # https://github.com/chef/bento/issues/661#issuecomment-248136601
        DEBIAN_FRONTEND=noninteractive apt-get -y -o Dpkg::Options::="--force-confdef" -o Dpkg::Options::="--force-confold" upgrade
      SHELL
    end

    # -*- mode: ruby -*-
  #+END_SRC

  #+BEGIN_SRC sh :session shiny
    cd ~/scmodes
    vagrant up --provision
  #+END_SRC

  #+RESULTS:
  #+begin_example

  [0mBringing machine 'default' up with 'virtualbox' provider...[0m
  default: Importing base box 'debian/stretch64'...[0m
  [0m[0m[K[0m[0mProgress: 40%[0m[0m[K[0m[0mProgress: 60%[0m[0m[K[0m[0mProgress: 90%[0m[0m[K[0m[1m==> default: Matching MAC address for NAT networking...[0m
  default: Checking if box 'debian/stretch64' is up to date...[0m
  default: A newer version of the box 'debian/stretch64' for provider 'virtualbox' is
  default: available! You currently have version '9.9.0'. The latest is version
  default: '9.9.1'. Run `vagrant box update` to update.[0m
  default: Setting the name of the VM: singlecell-modes[0m
  default: Fixed port collision for 22 => 2222. Now on port 2201.[0m
  default: Clearing any previously set network interfaces...[0m
  default: Preparing network interfaces based on configuration...[0m
  [0m    default: Adapter 1: nat[0m
  default: Forwarding ports...[0m
  5009 (host) (adapter 1)[0m
  2201 (host) (adapter 1)[0m
  default: Running 'pre-boot' VM customizations...[0m
  default: Booting VM...[0m
  default: Waiting for machine to boot. This may take a few minutes...[0m
  [0m    default: SSH address: 127.0.0.1:2201[0m
  [0m    default: SSH username: vagrant[0m
  [0m    default: SSH auth method: private key[0m
  [0m    default: 
      default: Vagrant insecure key detected. Vagrant will automatically replace
      default: this with a newly generated keypair for better security.[0m
  [0m    default: 
      default: Inserting generated public key within guest...[0m
  [0m    default: Removing insecure key from the guest if it's present...[0m
  [0m    default: Key inserted! Disconnecting and reconnecting using new SSH key...[0m
  default: Machine booted and ready![0m
  default: Checking for guest additions in VM...[0m
  [0m    default: No guest additions were detected on the base box for this VM! Guest
      default: additions are required for forwarded ports, shared folders, host only
      default: networking, and more. If SSH fails on this machine, please install
      default: the guest additions and repackage the box to continue.
      default: 
      default: This is not an error message; everything may continue to work properly,
      default: in which case you may ignore this message.[0m
  default: Installing rsync to the VM...[0m
  default: Rsyncing folder: /home/aksarkar/scmodes/ => /vagrant[0m
  default: Running provisioner: shell...[0m
  [0m    default: Running: inline script[0m
  [0;32m    default: Hit:1 http://security.debian.org/debian-security stretch/updates InRelease[0m
  [0;32m    default: Ign:2 http://deb.debian.org/debian stretch InRelease[0m
  [0;32m    default: Hit:3 http://deb.debian.org/debian stretch Release[0m
  [0;32m    default: Reading package lists...[0m
  [0;32m    default: Reading package lists...[0m
  [0;32m    default: Building dependency tree...[0m
  [0;32m    default: 
      default: Reading state information...[0m
  [0;32m    default: The following additional packages will be installed:[0m
  [0;32m    default:   git-man liberror-perl patch[0m
  [0;32m    default: Suggested packages:
      default:   git-daemon-run | git-daemon-sysvinit git-doc git-el git-email git-gui gitk
      default:   gitweb git-arch git-cvs git-mediawiki git-svn ed diffutils-doc[0m
  [0;32m    default: The following NEW packages will be installed:[0m
  [0;32m    default:   git git-man liberror-perl patch[0m
  [0;32m    default: 0 upgraded, 4 newly installed, 0 to remove and 20 not upgraded.
      default: Need to get 5,739 kB of archives.
      default: After this operation, 31.3 MB of additional disk space will be used.
      default: Do you want to continue? [Y/n] Abort.[0m
  [0;32m    default: Reading package lists...[0m
  [0;32m    default: Building dependency tree...[0m
  [0;32m    default: 
      default: Reading state information...[0m
  [0;32m    default: Calculating upgrade...[0m
  [0;32m    default: The following packages will be upgraded:[0m
  [0;32m    default:   bind9-host dbus libbind9-140 libdbus-1-3 libdns-export162 libdns162[0m
  [0;32m    default:   libexpat1 libirs141 libisc-export160 libisc160 libisccc140 libisccfg140[0m
  [0;32m    default:   liblwres141 libssl1.0.2 libssl1.1 linux-image-4.9.0-9-amd64 openssl
      default:   vim-common vim-tiny xxd[0m
  [0;32m    default: 20 upgraded, 0 newly installed, 0 to remove and 0 not upgraded.
      default: Need to get 47.7 MB of archives.
      default: After this operation, 3,072 B disk space will be freed.
      default: Get:1 http://security.debian.org/debian-security stretch/updates/main amd64 libssl1.0.2 amd64 1.0.2s-1~deb9u1 [1,302 kB][0m
  [0;32m    default: Get:2 http://security.debian.org/debian-security stretch/updates/main amd64 libssl1.1 amd64 1.1.0k-1~deb9u1 [1,356 kB][0m
  [0;32m    default: Get:3 http://security.debian.org/debian-security stretch/updates/main amd64 xxd amd64 2:8.0.0197-4+deb9u3 [132 kB][0m
  [0;32m    default: Get:4 http://security.debian.org/debian-security stretch/updates/main amd64 vim-tiny amd64 2:8.0.0197-4+deb9u3 [446 kB][0m
  [0;32m    default: Get:5 http://security.debian.org/debian-security stretch/updates/main amd64 vim-common all 2:8.0.0197-4+deb9u3 [159 kB][0m
  [0;32m    default: Get:6 http://security.debian.org/debian-security stretch/updates/main amd64 bind9-host amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [231 kB][0m
  [0;32m    default: Get:7 http://security.debian.org/debian-security stretch/updates/main amd64 libisc160 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [398 kB][0m
  [0;32m    default: Get:8 http://security.debian.org/debian-security stretch/updates/main amd64 libdns162 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [1,078 kB][0m
  [0;32m    default: Get:9 http://security.debian.org/debian-security stretch/updates/main amd64 libisccc140 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [199 kB][0m
  [0;32m    default: Get:10 http://security.debian.org/debian-security stretch/updates/main amd64 libisccfg140 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [223 kB][0m
  [0;32m    default: Get:11 http://security.debian.org/debian-security stretch/updates/main amd64 libbind9-140 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [206 kB][0m
  [0;32m    default: Get:12 http://security.debian.org/debian-security stretch/updates/main amd64 liblwres141 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [214 kB][0m
  [0;32m    default: Get:13 http://security.debian.org/debian-security stretch/updates/main amd64 dbus amd64 1.10.28-0+deb9u1 [212 kB][0m
  [0;32m    default: Get:14 http://security.debian.org/debian-security stretch/updates/main amd64 libdbus-1-3 amd64 1.10.28-0+deb9u1 [195 kB][0m
  [0;32m    default: Get:15 http://security.debian.org/debian-security stretch/updates/main amd64 libexpat1 amd64 2.2.0-2+deb9u2 [83.6 kB][0m
  [0;32m    default: Get:16 http://security.debian.org/debian-security stretch/updates/main amd64 libirs141 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [200 kB][0m
  [0;32m    default: Get:17 http://security.debian.org/debian-security stretch/updates/main amd64 libisc-export160 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [335 kB][0m
  [0;32m    default: Get:18 http://security.debian.org/debian-security stretch/updates/main amd64 libdns-export162 amd64 1:9.10.3.dfsg.P4-12.3+deb9u5 [852 kB][0m
  [0;32m    default: Get:19 http://security.debian.org/debian-security stretch/updates/main amd64 linux-image-4.9.0-9-amd64 amd64 4.9.168-1+deb9u4 [39.2 MB][0m
  [0;32m    default: Get:20 http://security.debian.org/debian-security stretch/updates/main amd64 openssl amd64 1.1.0k-1~deb9u1 [747 kB][0m
  [0;32m    default: apt-listchanges: Reading changelogs...[0m
  [0;32m    default: Preconfiguring packages ...[0m
  [0;32m    default: Fetched 47.7 MB in 4s (11.5 MB/s)[0m
  (Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%[0m
  [0m
  [0m
  [0m
  [0m
  (Reading database ... 31327 files and directories currently installed.)[0m
  [0;32m    default: Preparing to unpack .../00-libssl1.0.2_1.0.2s-1~deb9u1_amd64.deb ...[0m
  [0;32m    default: Unpacking libssl1.0.2:amd64 (1.0.2s-1~deb9u1) over (1.0.2r-1~deb9u1) ...[0m
  [0;32m    default: Preparing to unpack .../01-libssl1.1_1.1.0k-1~deb9u1_amd64.deb ...[0m
  [0;32m    default: Unpacking libssl1.1:amd64 (1.1.0k-1~deb9u1) over (1.1.0j-1~deb9u1) ...[0m
  3a8.0.0197-4+deb9u3_amd64.deb ...[0m
  [0;32m    default: Unpacking xxd (2:8.0.0197-4+deb9u3) over (2:8.0.0197-4+deb9u1) ...[0m
  3a8.0.0197-4+deb9u3_amd64.deb ...[0m
  [0;32m    default: Unpacking vim-tiny (2:8.0.0197-4+deb9u3) over (2:8.0.0197-4+deb9u1) ...[0m
  3a8.0.0197-4+deb9u3_all.deb ...[0m
  [0;32m    default: Unpacking vim-common (2:8.0.0197-4+deb9u3) over (2:8.0.0197-4+deb9u1) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking bind9-host (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libisc160:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libdns162:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libisccc140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libisccfg140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libbind9-140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking liblwres141:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  [0;32m    default: Preparing to unpack .../12-dbus_1.10.28-0+deb9u1_amd64.deb ...[0m
  [0;32m    default: Unpacking dbus (1.10.28-0+deb9u1) over (1.10.26-0+deb9u1) ...[0m
  [0;32m    default: Preparing to unpack .../13-libdbus-1-3_1.10.28-0+deb9u1_amd64.deb ...[0m
  [0;32m    default: Unpacking libdbus-1-3:amd64 (1.10.28-0+deb9u1) over (1.10.26-0+deb9u1) ...[0m
  [0;32m    default: Preparing to unpack .../14-libexpat1_2.2.0-2+deb9u2_amd64.deb ...[0m
  [0;32m    default: Unpacking libexpat1:amd64 (2.2.0-2+deb9u2) over (2.2.0-2+deb9u1) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libirs141:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libisc-export160 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  3a9.10.3.dfsg.P4-12.3+deb9u5_amd64.deb ...[0m
  [0;32m    default: Unpacking libdns-export162 (1:9.10.3.dfsg.P4-12.3+deb9u5) over (1:9.10.3.dfsg.P4-12.3+deb9u4) ...[0m
  [0;32m    default: Preparing to unpack .../18-linux-image-4.9.0-9-amd64_4.9.168-1+deb9u4_amd64.deb ...[0m
  [0;32m    default: Unpacking linux-image-4.9.0-9-amd64 (4.9.168-1+deb9u4) over (4.9.168-1) ...[0m
  [0;32m    default: Preparing to unpack .../19-openssl_1.1.0k-1~deb9u1_amd64.deb ...[0m
  [0;32m    default: Unpacking openssl (1.1.0k-1~deb9u1) over (1.1.0j-1~deb9u1) ...[0m
  [0;32m    default: Setting up libexpat1:amd64 (2.2.0-2+deb9u2) ...[0m
  [0;32m    default: Setting up libisc160:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up libisc-export160 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Processing triggers for mime-support (3.60) ...[0m
  [0;32m    default: Setting up xxd (2:8.0.0197-4+deb9u3) ...[0m
  [0;32m    default: Setting up libssl1.0.2:amd64 (1.0.2s-1~deb9u1) ...[0m
  [0;32m    default: Setting up libisccc140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up linux-image-4.9.0-9-amd64 (4.9.168-1+deb9u4) ...[0m
  [0;32m    default: /etc/kernel/postinst.d/initramfs-tools:
      default: update-initramfs: Generating /boot/initrd.img-4.9.0-9-amd64[0m
  [0;32m    default: /etc/kernel/postinst.d/zz-update-grub:
      default: Generating grub configuration file ...[0m
  [0;32m    default: Found linux image: /boot/vmlinuz-4.9.0-9-amd64[0m
  [0;32m    default: Found initrd image: /boot/initrd.img-4.9.0-9-amd64[0m
  [0;32m    default: Found linux image: /boot/vmlinuz-4.9.0-6-amd64[0m
  [0;32m    default: Found initrd image: /boot/initrd.img-4.9.0-6-amd64[0m
  [0;32m    default: done[0m
  [0;32m    default: Processing triggers for libc-bin (2.24-11+deb9u4) ...[0m
  [0;32m    default: Setting up libssl1.1:amd64 (1.1.0k-1~deb9u1) ...[0m
  [0;32m    default: Processing triggers for systemd (232-25+deb9u11) ...[0m
  [0;32m    default: Setting up liblwres141:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up openssl (1.1.0k-1~deb9u1) ...[0m
  [0;32m    default: Setting up vim-common (2:8.0.0197-4+deb9u3) ...[0m
  [0;32m    default: Processing triggers for man-db (2.7.6.1-2) ...[0m
  [0;32m    default: Setting up libdbus-1-3:amd64 (1.10.28-0+deb9u1) ...[0m
  [0;32m    default: Setting up vim-tiny (2:8.0.0197-4+deb9u3) ...[0m
  [0;32m    default: Setting up libdns162:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up libisccfg140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up libdns-export162 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up libirs141:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up libbind9-140:amd64 (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Setting up dbus (1.10.28-0+deb9u1) ...[0m
  [0;32m    default: A reboot is required to replace the running dbus-daemon.
      default: Please reboot the system when convenient.[0m
  [0;32m    default: Setting up bind9-host (1:9.10.3.dfsg.P4-12.3+deb9u5) ...[0m
  [0;32m    default: Processing triggers for libc-bin (2.24-11+deb9u4) ...[0m
  [0m[0m
  default: Machine 'default' has a post `vagrant up` message. This is a message
  default: from the creator of the Vagrantfile, and not from Vagrant itself:
  default:
  default: Vanilla Debian box. See https://app.vagrantup.com/debian for help and bug reports[0m
  #+end_example

  (Re)start the VM.

  #+BEGIN_SRC sh :session shiny
    cd ~/scmodes
    vagrant halt
    vagrant up --no-provision
  #+END_SRC

  #+RESULTS:
  #+begin_example

  aksarkar@shiny:~/scmodes$ [0mBringing machine 'default' up with 'virtualbox' provider...[0m
  default: Checking if box 'debian/stretch64' is up to date...[0m
  default: A newer version of the box 'debian/stretch64' for provider 'virtualbox' is
  default: available! You currently have version '9.9.0'. The latest is version
  default: '9.9.1'. Run `vagrant box update` to update.[0m
  default: Clearing any previously set forwarded ports...[0m
  default: Fixed port collision for 22 => 2222. Now on port 2200.[0m
  default: Clearing any previously set network interfaces...[0m
  default: Preparing network interfaces based on configuration...[0m
  [0m    default: Adapter 1: nat[0m
  default: Forwarding ports...[0m
  5009 (host) (adapter 1)[0m
  2200 (host) (adapter 1)[0m
  default: Running 'pre-boot' VM customizations...[0m
  default: Booting VM...[0m
  default: Waiting for machine to boot. This may take a few minutes...[0m
  [0m    default: SSH address: 127.0.0.1:2200[0m
  [0m    default: SSH username: vagrant[0m
  [0m    default: SSH auth method: private key[0m
  default: Machine booted and ready![0m
  default: Checking for guest additions in VM...[0m
  [0m    default: No guest additions were detected on the base box for this VM! Guest
      default: additions are required for forwarded ports, shared folders, host only
      default: networking, and more. If SSH fails on this machine, please install
      default: the guest additions and repackage the box to continue.
      default: 
      default: This is not an error message; everything may continue to work properly,
      default: in which case you may ignore this message.[0m
  default: Rsyncing folder: /home/aksarkar/scmodes/ => /vagrant[0m
  default: Machine not provisioned because `--no-provision` is specified.[0m
  [0m[0m
  default: Machine 'default' has a post `vagrant up` message. This is a message
  default: from the creator of the Vagrantfile, and not from Vagrant itself:
  default:
  default: Vanilla Debian box. See https://app.vagrantup.com/debian for help and bug reports[0m
  #+end_example

  ssh into the VM.

  #+BEGIN_SRC sh :session shiny
    vagrant global-status
  #+END_SRC

  #+RESULTS:
  #+begin_example
  [0mid       [0m[0mname    [0m[0mprovider   [0m[0mstate    [0m[0mdirectory                           [0m[0m[0m
  [0m-------------------------------------------------------------------------[0m
  [0m21c0820  [0m[0mdefault [0m[0mvirtualbox [0m[0mrunning  [0m[0m/home/aksarkar/scqtl-browser        [0m[0m[0m
  [0m79a6f03  [0m[0mdefault [0m[0mvirtualbox [0m[0mpoweroff [0m[0m/home/aksarkar/debian-testing       [0m[0m[0m
  [0mf7b1184  [0m[0mdefault [0m[0mvirtualbox [0m[0mrunning  [0m[0m/home/aksarkar/hypoxia              [0m[0m[0m
  [0m4233c3c  [0m[0mdefault [0m[0mvirtualbox [0m[0mrunning  [0m[0m/home/aksarkar/scmodes              [0m[0m[0m
  [0m 
  The above shows information about all known Vagrant environments
  on this machine. This data is cached and may not be completely
  up-to-date. To interact with any of the machines, you can go to
  that directory and run Vagrant, or you can use the ID directly
  with Vagrant commands from any directory. For example:
  "vagrant destroy 1a2b3c4d"[0m
  #+end_example

  #+BEGIN_SRC sh :session shiny
    vagrant ssh 4233c3c
  #+END_SRC

  #+RESULTS:
  #+begin_example

  1 SMP Debian 4.9.168-1+deb9u4 (2019-07-19) x86_64

  The programs included with the Debian GNU/Linux system are free software;
  the exact distribution terms for each program are described in the
  individual files in /usr/share/doc/*/copyright.

  Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
  permitted by applicable law.
  Last login: Mon Jul 22 16:41:19 2019 from 10.0.2.2
  #+end_example

  The data are available on the VM under ~/vagrant~. Fake the location of the
  database as it appears on the test server (~*.midway2.rcc.uchicago.edu~).

  #+BEGIN_SRC sh :session shiny
    sudo mkdir -p /project2/mstephens/aksarkar/projects/singlecell-modes/
    sudo ln -s /vagrant /project2/mstephens/aksarkar/projects/singlecell-modes/browser
  #+END_SRC

  #+RESULTS:

  Install ~miniconda3~ as user ~vagrant~.

  #+BEGIN_SRC sh :session shiny
    wget -q https://repo.continuum.io/miniconda/Miniconda3-latest-Linux-x86_64.sh
    bash Miniconda3-latest-Linux-x86_64.sh -b
    echo "export PATH=$PATH:$HOME/miniconda3/bin" >>$HOME/.bashrc
    . $HOME/.bashrc
  #+END_SRC

  #+RESULTS:
  #+begin_example

  PREFIX=/home/vagrant/miniconda3
  installing: python-3.7.3-h0371630_0 ...
  Python 3.7.3
  installing: ca-certificates-2019.1.23-0 ...
  installing: libgcc-ng-8.2.0-hdf63c60_1 ...
  installing: libstdcxx-ng-8.2.0-hdf63c60_1 ...
  installing: libffi-3.2.1-hd88cf55_4 ...
  installing: ncurses-6.1-he6710b0_1 ...
  installing: openssl-1.1.1b-h7b6447c_1 ...
  installing: xz-5.2.4-h14c3975_4 ...
  installing: yaml-0.1.7-had09818_2 ...
  installing: zlib-1.2.11-h7b6447c_3 ...
  installing: libedit-3.1.20181209-hc058e9b_0 ...
  installing: readline-7.0-h7b6447c_5 ...
  installing: tk-8.6.8-hbc83047_0 ...
  installing: sqlite-3.27.2-h7b6447c_0 ...
  installing: asn1crypto-0.24.0-py37_0 ...
  installing: certifi-2019.3.9-py37_0 ...
  installing: chardet-3.0.4-py37_1 ...
  installing: idna-2.8-py37_0 ...
  installing: pycosat-0.6.3-py37h14c3975_0 ...
  installing: pycparser-2.19-py37_0 ...
  installing: pysocks-1.6.8-py37_0 ...
  installing: ruamel_yaml-0.15.46-py37h14c3975_0 ...
  installing: six-1.12.0-py37_0 ...
  installing: cffi-1.12.2-py37h2e261b9_1 ...
  installing: setuptools-41.0.0-py37_0 ...
  installing: cryptography-2.6.1-py37h1ba5d50_0 ...
  installing: wheel-0.33.1-py37_0 ...
  installing: pip-19.0.3-py37_0 ...
  installing: pyopenssl-19.0.0-py37_0 ...
  installing: urllib3-1.24.1-py37_0 ...
  installing: requests-2.21.0-py37_0 ...
  installing: conda-4.6.14-py37_0 ...
  installation finished.
  #+end_example

  Initialize a new environment.

  #+BEGIN_SRC sh :session shiny
    conda update -yn base conda
    conda create -yqn scmodes numpy scipy pandas bokeh=1.2.0=py37_0
  #+END_SRC

  #+RESULTS:
  #+begin_example
  Collecting package metadata: - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - \ | / - done
  Solving environment: | / - \ | / - \ | done
  # Package Plan ##

    environment location: /home/vagrant/miniconda3

    added / updated specs:
      - conda


  The following packages will be downloaded:

      package                    |            build
      ---------------------------|-----------------
      _libgcc_mutex-0.1          |             main           3 KB
      bzip2-1.0.8                |       h7b6447c_0         105 KB
      ca-certificates-2019.5.15  |                0         133 KB
      certifi-2019.6.16          |           py37_0         154 KB
      conda-4.7.10               |           py37_0         3.0 MB
      conda-package-handling-1.3.11|           py37_0         260 KB
      libarchive-3.3.3           |       h5d8350f_5         1.5 MB
      libxml2-2.9.9              |       hea5a465_1         2.0 MB
      lz4-c-1.8.1.2              |       h14c3975_0         158 KB
      lzo-2.10                   |       h49e0be7_2         313 KB
      openssl-1.1.1c             |       h7b6447c_1         3.8 MB
      python-libarchive-c-2.8    |          py37_11          23 KB
      tqdm-4.32.1                |             py_0          48 KB
      zstd-1.3.7                 |       h0b5b093_0         887 KB
      ------------------------------------------------------------
                                             Total:        12.3 MB

  The following NEW packages will be INSTALLED:

    _libgcc_mutex      pkgs/main/linux-64::_libgcc_mutex-0.1-main
    bzip2              pkgs/main/linux-64::bzip2-1.0.8-h7b6447c_0
    conda-package-han~ pkgs/main/linux-64::conda-package-handling-1.3.11-py37_0
    libarchive         pkgs/main/linux-64::libarchive-3.3.3-h5d8350f_5
    libxml2            pkgs/main/linux-64::libxml2-2.9.9-hea5a465_1
    lz4-c              pkgs/main/linux-64::lz4-c-1.8.1.2-h14c3975_0
    lzo                pkgs/main/linux-64::lzo-2.10-h49e0be7_2
    python-libarchive~ pkgs/main/linux-64::python-libarchive-c-2.8-py37_11
    tqdm               pkgs/main/noarch::tqdm-4.32.1-py_0
    zstd               pkgs/main/linux-64::zstd-1.3.7-h0b5b093_0

  The following packages will be UPDATED:
  2019.5.15-0
  2019.6.16-py37_0
  4.7.10-py37_0
  1.1.1c-h7b6447c_1



  Downloading and Extracting Packages
  conda-package-handli | 260 KB    | ############################################################################################################# | 100%
  certifi-2019.6.16    | 154 KB    | ############################################################################################################# | 100%
  tqdm-4.32.1          | 48 KB     | ############################################################################################################# | 100%
  lz4-c-1.8.1.2        | 158 KB    | ############################################################################################################# | 100%
  lzo-2.10             | 313 KB    | ############################################################################################################# | 100%
  openssl-1.1.1c       | 3.8 MB    | ###################5                                                                                          |  18% openssl-1.1.1c       | 3.8 MB    | ########################################4                                                                     |  37% openssl-1.1.1c       | 3.8 MB    | ##############################################################3                                               |  57% openssl-1.1.1c       | 3.8 MB    | ####################################################################################2                         |  77% openssl-1.1.1c       | 3.8 MB    | ####################################################################################################5         |  92% openssl-1.1.1c       | 3.8 MB    | ############################################################################################################# | 100%
  conda-4.7.10         | 3.0 MB    | ########################2                                                                                     |  22% conda-4.7.10         | 3.0 MB    | ##########################################################7                                                   |  54% conda-4.7.10         | 3.0 MB    | ###################################################################################4                          |  77% conda-4.7.10         | 3.0 MB    | ####################################################################################################6         |  92% conda-4.7.10         | 3.0 MB    | ############################################################################################################# | 100%
  python-libarchive-c- | 23 KB     | ############################################################################################################# | 100%
  zstd-1.3.7           | 887 KB    | ######################################################################################1                       |  79% zstd-1.3.7           | 887 KB    | ############################################################################################################# | 100%
  _libgcc_mutex-0.1    | 3 KB      | ############################################################################################################# | 100%
  bzip2-1.0.8          | 105 KB    | ############################################################################################################# | 100%
  libxml2-2.9.9        | 2.0 MB    | ##############################3                                                                               |  28% libxml2-2.9.9        | 2.0 MB    | #############################################################################5                                |  71% libxml2-2.9.9        | 2.0 MB    | #################################################################################################9            |  90% libxml2-2.9.9        | 2.0 MB    | ############################################################################################################# | 100%
  ca-certificates-2019 | 133 KB    | ############################################################################################################# | 100%
  libarchive-3.3.3     | 1.5 MB    | #####################################################8                                                        |  49% libarchive-3.3.3     | 1.5 MB    | ############################################################################################4                 |  85% libarchive-3.3.3     | 1.5 MB    | ############################################################################################################# | 100% 
  Preparing transaction: - done
  Verifying transaction: | / done
  Executing transaction: \ | done
  Collecting package metadata (current_repodata.json): ...working... done
  Solving environment: ...working... done
  # Package Plan ##

    environment location: /home/vagrant/miniconda3/envs/scmodes

    added / updated specs:
      - bokeh==1.2.0=py37_0
      - numpy
      - pandas
      - scipy


  The following packages will be downloaded:

      package                    |            build
      ---------------------------|-----------------
      _libgcc_mutex-0.1          |             main           3 KB
      blas-1.0                   |              mkl           6 KB
      bokeh-1.2.0                |           py37_0         3.5 MB
      ca-certificates-2019.5.15  |                0         126 KB
      certifi-2019.6.16          |           py37_0         150 KB
      freetype-2.9.1             |       h8a8886c_1         550 KB
      intel-openmp-2019.4        |              243         729 KB
      jinja2-2.10.1              |           py37_0         195 KB
      jpeg-9b                    |       h024ee3a_2         214 KB
      libedit-3.1.20181209       |       hc058e9b_0         163 KB
      libffi-3.2.1               |       hd88cf55_4          40 KB
      libgcc-ng-9.1.0            |       hdf63c60_0         5.1 MB
      libgfortran-ng-7.3.0       |       hdf63c60_0        1006 KB
      libpng-1.6.37              |       hbc83047_0         278 KB
      libstdcxx-ng-9.1.0         |       hdf63c60_0         3.1 MB
      libtiff-4.0.10             |       h2733197_2         435 KB
      markupsafe-1.1.1           |   py37h7b6447c_0          29 KB
      mkl-2019.4                 |              243       131.2 MB
      mkl-service-2.0.2          |   py37h7b6447c_0          65 KB
      mkl_fft-1.0.12             |   py37ha843d7b_0         154 KB
      mkl_random-1.0.2           |   py37hd81dba3_0         361 KB
      ncurses-6.1                |       he6710b0_1         777 KB
      numpy-1.16.4               |   py37h7e9f1db_0          48 KB
      numpy-base-1.16.4          |   py37hde5b4d6_0         3.5 MB
      olefile-0.46               |           py37_0          50 KB
      openssl-1.1.1c             |       h7b6447c_1         2.5 MB
      packaging-19.0             |           py37_0          39 KB
      pandas-0.24.2              |   py37he6710b0_0         8.6 MB
      pillow-6.1.0               |   py37h34e0f95_0         635 KB
      pip-19.1.1                 |           py37_0         1.6 MB
      pyparsing-2.4.0            |             py_0          58 KB
      python-3.7.3               |       h0371630_0        32.1 MB
      python-dateutil-2.8.0      |           py37_0         266 KB
      pytz-2019.1                |             py_0         236 KB
      pyyaml-5.1.1               |   py37h7b6447c_0         177 KB
      readline-7.0               |       h7b6447c_5         324 KB
      scipy-1.3.0                |   py37h7c811a0_0        18.0 MB
      setuptools-41.0.1          |           py37_0         506 KB
      six-1.12.0                 |           py37_0          23 KB
      sqlite-3.29.0              |       h7b6447c_0         1.9 MB
      tk-8.6.8                   |       hbc83047_0         2.8 MB
      tornado-6.0.3              |   py37h7b6447c_0         584 KB
      wheel-0.33.4               |           py37_0          41 KB
      xz-5.2.4                   |       h14c3975_4         283 KB
      yaml-0.1.7                 |       had09818_2          73 KB
      zlib-1.2.11                |       h7b6447c_3         103 KB
      zstd-1.3.7                 |       h0b5b093_0         401 KB
      ------------------------------------------------------------
                                             Total:       222.8 MB

  The following NEW packages will be INSTALLED:

    _libgcc_mutex      pkgs/main/linux-64::_libgcc_mutex-0.1-main
    blas               pkgs/main/linux-64::blas-1.0-mkl
    bokeh              pkgs/main/linux-64::bokeh-1.2.0-py37_0
    ca-certificates    pkgs/main/linux-64::ca-certificates-2019.5.15-0
    certifi            pkgs/main/linux-64::certifi-2019.6.16-py37_0
    freetype           pkgs/main/linux-64::freetype-2.9.1-h8a8886c_1
    intel-openmp       pkgs/main/linux-64::intel-openmp-2019.4-243
    jinja2             pkgs/main/linux-64::jinja2-2.10.1-py37_0
    jpeg               pkgs/main/linux-64::jpeg-9b-h024ee3a_2
    libedit            pkgs/main/linux-64::libedit-3.1.20181209-hc058e9b_0
    libffi             pkgs/main/linux-64::libffi-3.2.1-hd88cf55_4
    libgcc-ng          pkgs/main/linux-64::libgcc-ng-9.1.0-hdf63c60_0
    libgfortran-ng     pkgs/main/linux-64::libgfortran-ng-7.3.0-hdf63c60_0
    libpng             pkgs/main/linux-64::libpng-1.6.37-hbc83047_0
    libstdcxx-ng       pkgs/main/linux-64::libstdcxx-ng-9.1.0-hdf63c60_0
    libtiff            pkgs/main/linux-64::libtiff-4.0.10-h2733197_2
    markupsafe         pkgs/main/linux-64::markupsafe-1.1.1-py37h7b6447c_0
    mkl                pkgs/main/linux-64::mkl-2019.4-243
    mkl-service        pkgs/main/linux-64::mkl-service-2.0.2-py37h7b6447c_0
    mkl_fft            pkgs/main/linux-64::mkl_fft-1.0.12-py37ha843d7b_0
    mkl_random         pkgs/main/linux-64::mkl_random-1.0.2-py37hd81dba3_0
    ncurses            pkgs/main/linux-64::ncurses-6.1-he6710b0_1
    numpy              pkgs/main/linux-64::numpy-1.16.4-py37h7e9f1db_0
    numpy-base         pkgs/main/linux-64::numpy-base-1.16.4-py37hde5b4d6_0
    olefile            pkgs/main/linux-64::olefile-0.46-py37_0
    openssl            pkgs/main/linux-64::openssl-1.1.1c-h7b6447c_1
    packaging          pkgs/main/linux-64::packaging-19.0-py37_0
    pandas             pkgs/main/linux-64::pandas-0.24.2-py37he6710b0_0
    pillow             pkgs/main/linux-64::pillow-6.1.0-py37h34e0f95_0
    pip                pkgs/main/linux-64::pip-19.1.1-py37_0
    pyparsing          pkgs/main/noarch::pyparsing-2.4.0-py_0
    python             pkgs/main/linux-64::python-3.7.3-h0371630_0
    python-dateutil    pkgs/main/linux-64::python-dateutil-2.8.0-py37_0
    pytz               pkgs/main/noarch::pytz-2019.1-py_0
    pyyaml             pkgs/main/linux-64::pyyaml-5.1.1-py37h7b6447c_0
    readline           pkgs/main/linux-64::readline-7.0-h7b6447c_5
    scipy              pkgs/main/linux-64::scipy-1.3.0-py37h7c811a0_0
    setuptools         pkgs/main/linux-64::setuptools-41.0.1-py37_0
    six                pkgs/main/linux-64::six-1.12.0-py37_0
    sqlite             pkgs/main/linux-64::sqlite-3.29.0-h7b6447c_0
    tk                 pkgs/main/linux-64::tk-8.6.8-hbc83047_0
    tornado            pkgs/main/linux-64::tornado-6.0.3-py37h7b6447c_0
    wheel              pkgs/main/linux-64::wheel-0.33.4-py37_0
    xz                 pkgs/main/linux-64::xz-5.2.4-h14c3975_4
    yaml               pkgs/main/linux-64::yaml-0.1.7-had09818_2
    zlib               pkgs/main/linux-64::zlib-1.2.11-h7b6447c_3
    zstd               pkgs/main/linux-64::zstd-1.3.7-h0b5b093_0


  Preparing transaction: ...working... done
  Verifying transaction: ...working... done
  Executing transaction: ...working... done
  #+end_example

  ~rsync~ the code and data to the server.

  #+BEGIN_SRC sh :dir /scratch/midway2/aksarkar/modes/
    rsync -au /project2/mstephens/aksarkar/projects/singlecell-modes/browser/ shiny:scmodes/
  #+END_SRC

  #+RESULTS:

  Start the QTL browser. The code/data are available under ~/vagrant~ inside the VM.

  #+BEGIN_SRC sh :session shiny
    cd /vagrant
    source activate scmodes
    nohup bokeh serve capture gof --port 5006 --allow-websocket-origin=shiny.stephenslab.uchicago.edu:5009 &
  #+END_SRC

  #+RESULTS:
  : [1]+  Done                    nohup bokeh serve capture --port 5006 --allow-websocket-origin=shiny.stephenslab.uchicago.edu:5009
  : (scmodes) vagrant@stretch:/vagrant$ [1] 739
